{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.3.1", "config": {"name": "model_1", "input_layers": [["conv1_input", 0, 0]], "layers": [{"name": "conv1_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "conv1_input", "sparse": false, "batch_input_shape": [null, 16, 112, 112, 3], "dtype": "float32"}}, {"name": "conv1", "inbound_nodes": [[["conv1_input", 0, 0, {}]]], "class_name": "Conv3D", "config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "name": "conv1", "filters": 64, "activation": "relu", "batch_input_shape": [null, 16, 112, 112, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "strides": [1, 1, 1]}}, {"name": "pool1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "MaxPooling3D", "config": {"padding": "same", "strides": [1, 2, 2], "dtype": "float32", "trainable": true, "name": "pool1", "data_format": "channels_last", "pool_size": [1, 2, 2]}}, {"name": "conv2", "inbound_nodes": [[["pool1", 0, 0, {}]]], "class_name": "Conv3D", "config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "name": "conv2", "filters": 128, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "strides": [1, 1, 1]}}, {"name": "pool2", "inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "MaxPooling3D", "config": {"padding": "valid", "strides": [2, 2, 2], "dtype": "float32", "trainable": true, "name": "pool2", "data_format": "channels_last", "pool_size": [2, 2, 2]}}, {"name": "conv3a", "inbound_nodes": [[["pool2", 0, 0, {}]]], "class_name": "Conv3D", "config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "name": "conv3a", "filters": 256, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "strides": [1, 1, 1]}}, {"name": "conv3b", "inbound_nodes": [[["conv3a", 0, 0, {}]]], "class_name": "Conv3D", "config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "name": "conv3b", "filters": 256, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "strides": [1, 1, 1]}}, {"name": "pool3", "inbound_nodes": [[["conv3b", 0, 0, {}]]], "class_name": "MaxPooling3D", "config": {"padding": "valid", "strides": [2, 2, 2], "dtype": "float32", "trainable": true, "name": "pool3", "data_format": "channels_last", "pool_size": [2, 2, 2]}}, {"name": "conv4a", "inbound_nodes": [[["pool3", 0, 0, {}]]], "class_name": "Conv3D", "config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "name": "conv4a", "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "strides": [1, 1, 1]}}, {"name": "conv4b", "inbound_nodes": [[["conv4a", 0, 0, {}]]], "class_name": "Conv3D", "config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "name": "conv4b", "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "strides": [1, 1, 1]}}, {"name": "pool4", "inbound_nodes": [[["conv4b", 0, 0, {}]]], "class_name": "MaxPooling3D", "config": {"padding": "valid", "strides": [2, 2, 2], "dtype": "float32", "trainable": true, "name": "pool4", "data_format": "channels_last", "pool_size": [2, 2, 2]}}, {"name": "conv5a", "inbound_nodes": [[["pool4", 0, 0, {}]]], "class_name": "Conv3D", "config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "name": "conv5a", "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "strides": [1, 1, 1]}}, {"name": "conv5b", "inbound_nodes": [[["conv5a", 0, 0, {}]]], "class_name": "Conv3D", "config": {"bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "name": "conv5b", "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "strides": [1, 1, 1]}}, {"name": "zero_padding3d_1", "inbound_nodes": [[["conv5b", 0, 0, {}]]], "class_name": "ZeroPadding3D", "config": {"trainable": true, "name": "zero_padding3d_1", "padding": [[0, 0], [1, 1], [1, 1]], "data_format": "channels_last", "dtype": "float32"}}, {"name": "pool5", "inbound_nodes": [[["zero_padding3d_1", 0, 0, {}]]], "class_name": "MaxPooling3D", "config": {"padding": "valid", "strides": [2, 2, 2], "dtype": "float32", "trainable": true, "name": "pool5", "data_format": "channels_last", "pool_size": [2, 2, 2]}}, {"name": "flatten_1", "inbound_nodes": [[["pool5", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last", "dtype": "float32"}}, {"name": "fc6", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "name": "fc6", "units": 4096, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true}}], "output_layers": [["fc6", 0, 0]]}}