{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "batch_input_shape": [null, 4096], "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_regularizer": null, "units": 512}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "seed": null, "rate": 0.6, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_regularizer": null, "units": 32}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "dtype": "float32", "trainable": true, "seed": null, "rate": 0.6, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_regularizer": null, "units": 1}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}